app/Controllers/Chat.php

SELECT `nip`
FROM `dosen`
WHERE `nip` = '197508142006041001'
---
    public function index()
    {
        if (session()->get('level') == 'mhs') {
            $data = $this->db->table('mhs')->select('id_pa')->where('nim', session()->get('user'))->get()->getResultArray();
            return redirect()->to(base_url() . '/chat/' . $data[0]['id_pa']);
        } else {
            $data = $this->db->table('dosen')->select('nip')->where('nip', session()->get('user'))->get()->getResultArray();

SELECT *
FROM `chat`
WHERE (`sender` = '197508142006041001' AND receiver='D1A115015')OR(sender = 'D1A115015' AND `receiver` = '197508142006041001')
ORDER BY `send_at` ASC
---
    public function showMessage()
    {
        $user = session()->get('user');
        $receiver = $this->request->getVar('target');
        $where =  "(sender='{$user}' AND receiver='{$receiver}')OR(sender='{$receiver}' AND receiver='{$user}')";
        $data = $this->db->table('chat')->orderBy('send_at', 'ASC')->getWhere($where)->getResultArray();