app/Controllers/Home.php

    public function data()
    {
        if (session()->get('level') == 'mhs') {
            $sub_tbl = $this->db->table('mhs')->select('id_pa')->where('nim', session()->get('user'));
            $tbl = $this->db->table('dosen')->select('nip,nama')->where('nip', $sub_tbl);
            $tbl = $tbl->get();
            $sub_tbl2 = $this->db->table('mhs')->select('id_pa')->where('nim', session()->get('user'));
            $tbl2 = $this->db->table('mhs')->getWhere(array('id_pa' => $sub_tbl2));
        } else {
            $tbl = $this->db->table('dosen')->select('nip,nama')->where('nip', session()->get('user'));
            $tbl = $tbl->get();
---
SELECT `nip`, `nama`
FROM `dosen`
WHERE nip =(SELECT `id_pa` FROM `mhs` WHERE `nim` = 'D1A115015')
SELECT `nip`, `nama`
FROM `dosen`
WHERE `nip` = '197508142006041001'