app/Controllers/Pages.php

SELECT *
FROM `chat`
WHERE (`sender` = 'D1A115015' AND receiver='197508142006041001')OR(sender = '197508142006041001' AND `receiver` = 'D1A115015')
ORDER BY `send_at` ASC
---
    public function chat($receiver)
    {
        $user = session()->get('user');
        $where =  "(sender='{$user}' AND receiver='{$receiver}')OR(sender='{$receiver}' AND receiver='{$user}')";
        $data = $this->db->table('chat')->orderBy('send_at', 'ASC')->getWhere($where)->getResultArray();